## Production: backoff_retry_lambda

**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  

**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 5 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
aws_iam_role_policy_attachment.backoff_read_write_and_encrypt_deadletter_queue: Refreshing state... [id=backoff_lambda_role-arn:aws:iam::820252213580:policy/CovidAlertReadWriteAndEncryptDeadletterQueue]
aws_iam_role_policy_attachment.backoff_log_writer: Refreshing state... [id=backoff_lambda_role-arn:aws:iam::820252213580:policy/CovidAlertLogWriter]
aws_iam_role_policy_attachment.backoff_vpc_networking: Refreshing state... [id=backoff_lambda_role-arn:aws:iam::820252213580:policy/CovidAlertVplNetworking]
aws_iam_policy.read_write_and_encrypt_deadletter_queue: Refreshing state... [id=arn:aws:iam::820252213580:policy/CovidAlertReadWriteAndEncryptDeadletterQueue]
aws_iam_role_policy_attachment.backoff_update: Refreshing state... [id=backoff_lambda_role-arn:aws:iam::820252213580:policy/CovidAlertAggregateMetricsUpdateItem]
aws_iam_role.backoff: Refreshing state... [id=backoff_lambda_role]
aws_security_group.backoff_retry_sg: Refreshing state... [id=sg-0ed581601fe3fe7fc]
aws_security_group_rule.privatelink_metrics_backoff_ingress: Refreshing state... [id=sgrule-798161409]
aws_lambda_function.backoff_retry: Refreshing state... [id=backoff_retry]
aws_cloudwatch_metric_alarm.backoff_retry_average_duration: Refreshing state... [id=save-metrics-average-duration]
aws_cloudwatch_log_group.backoff_log_group: Refreshing state... [id=/aws/lambda/backoff_retry]
aws_lambda_event_source_mapping.dead_letters: Refreshing state... [id=89578793-102f-4d07-8988-7cc0dca14eb7]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.backoff_retry_average_duration will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "backoff_retry_average_duration" {
      ~ alarm_description         = "This metric monitors average duration for the save_metrics lambda" -> "This metric monitors average duration for the backoff_retry lambda"
      ~ dimensions                = {
          ~ "FunctionName" = "save-metrics" -> "backoff_retry"
        }
        id                        = "save-metrics-average-duration"
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # aws_iam_policy.backoff_retry will be created
  + resource "aws_iam_policy" "backoff_retry" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertBackoffRetryLambda"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:UpdateItem"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ca-central-1:820252213580:table/aggregate_metrics"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                          + "kms:GenerateDataKey",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:ca-central-1:820252213580:aggregation-lambda-dead-letter-queue",
                          + "arn:aws:kms:ca-central-1:820252213580:key/73667eeb-f327-4ee4-866a-2239de28f560",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.read_write_and_encrypt_deadletter_queue will be destroyed
  - resource "aws_iam_policy" "read_write_and_encrypt_deadletter_queue" {
      - arn       = "arn:aws:iam::820252213580:policy/CovidAlertReadWriteAndEncryptDeadletterQueue" -> null
      - id        = "arn:aws:iam::820252213580:policy/CovidAlertReadWriteAndEncryptDeadletterQueue" -> null
      - name      = "CovidAlertReadWriteAndEncryptDeadletterQueue" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                          - "kms:GenerateDataKey",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:ca-central-1:820252213580:aggregation-lambda-dead-letter-queue",
                          - "arn:aws:kms:ca-central-1:820252213580:key/73667eeb-f327-4ee4-866a-2239de28f560",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA356WXQFGI74BBYTVB" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # aws_iam_role_policy_attachment.backoff_log_writer will be destroyed
  - resource "aws_iam_role_policy_attachment" "backoff_log_writer" {
      - id         = "backoff_lambda_role-arn:aws:iam::820252213580:policy/CovidAlertLogWriter" -> null
      - policy_arn = "arn:aws:iam::820252213580:policy/CovidAlertLogWriter" -> null
      - role       = "backoff_lambda_role" -> null
    }

  # aws_iam_role_policy_attachment.backoff_read_write_and_encrypt_deadletter_queue will be destroyed
  - resource "aws_iam_role_policy_attachment" "backoff_read_write_and_encrypt_deadletter_queue" {
      - id         = "backoff_lambda_role-arn:aws:iam::820252213580:policy/CovidAlertReadWriteAndEncryptDeadletterQueue" -> null
      - policy_arn = "arn:aws:iam::820252213580:policy/CovidAlertReadWriteAndEncryptDeadletterQueue" -> null
      - role       = "backoff_lambda_role" -> null
    }

  # aws_iam_role_policy_attachment.backoff_retry will be created
  + resource "aws_iam_role_policy_attachment" "backoff_retry" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "backoff_lambda_role"
    }

  # aws_iam_role_policy_attachment.backoff_update will be destroyed
  - resource "aws_iam_role_policy_attachment" "backoff_update" {
      - id         = "backoff_lambda_role-arn:aws:iam::820252213580:policy/CovidAlertAggregateMetricsUpdateItem" -> null
      - policy_arn = "arn:aws:iam::820252213580:policy/CovidAlertAggregateMetricsUpdateItem" -> null
      - role       = "backoff_lambda_role" -> null
    }

  # aws_iam_role_policy_attachment.backoff_vpc_networking will be destroyed
  - resource "aws_iam_role_policy_attachment" "backoff_vpc_networking" {
      - id         = "backoff_lambda_role-arn:aws:iam::820252213580:policy/CovidAlertVplNetworking" -> null
      - policy_arn = "arn:aws:iam::820252213580:policy/CovidAlertVplNetworking" -> null
      - role       = "backoff_lambda_role" -> null
    }

Plan: 2 to add, 1 to change, 5 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"
```
</details>